src/main/resources/templates/buscarIdentificacion.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.touresbalon.com.co/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:consultarClientePorFacturacion>
         <!--Optional:-->
         <filtro>
            <identificacion>$!{body}</identificacion>
         </filtro>
      </ser:consultarClientePorFacturacion>
   </soapenv:Body>
</soapenv:Envelope>